FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC546xx/LPC546xx_LCDController.c
    SYSCON->PRESETCTRLSET[2] = (1<<2);    
    SYSCON->PRESETCTRLCLR[2] = (1<<2);

    // disable the display`
    LCD->CTRL &= ~LCD_CTRL_LcdEn;

    // ppl value to set = ppl / 16 -1 (2:7)
    // hsw value to set = hsw - 1     (8:15)
    // hfp value to set = hfp - 1     (16:23)
    // hbp value to set = hbp - 1     (24:31)
    LCD->TIMH = ((((((aSettings->iHorizontalPixelsPerLine) / 16) - 1)
            & 0x3F) << 2)
            | (((aSettings->iHorizontalSyncPulseWidth - 1) & 0xFF) << 8)
            | (((aSettings->iHorizontalFrontPorch - 1) & 0xFF) << 16)
            | (((aSettings->iHorizontalBackPorch - 1) & 0xFF) << 24));

    LCD->TIMV = ((((aSettings->iVerticalLinesPerPanel - 1) & 0x3FF) << 0)
            | (((aSettings->iVerticalSyncPulseWidth - 1) & 0x03F) << 10)
            | (((aSettings->iVerticalFrontPorch) & 0x0FF) << 16)
            | (((aSettings->iVerticalBackPorch) & 0x0FF) << 24));

    regValue = 0;
    if (aSettings->iACBiasPinFrequency)
        regValue = (((aSettings->iACBiasPinFrequency - 1) & 0x1F) << 6);

    if (aSettings->iInvertOutputEnable)
        regValue |= LCD_POL_IOE;

    if (aSettings->iInvertPanelClock)
        regValue |= LCD_POL_IPC;

    if (aSettings->iInvertHorizontalSync)
        regValue |= LCD_POL_IHS;

    if (aSettings->iInvertVerticalSync)
        regValue |= LCD_POL_IVS;

    // clocks per line (CPL)
    switch (aSettings->iPanelType) {
        case LCD_STANDARD_TFT:
        case LCD_ADVANCED_TFT:
        case LCD_HIGHLY_REFLECTIVE_TFT:
        default:
            regValue |= (((aSettings->iHorizontalPixelsPerLine - 1) & 0x3FF)
                    << 16);
            break;
        case LCD_4BIT_MONO:
            regValue |= ((((aSettings->iHorizontalPixelsPerLine / 4) - 1)
                    & 0x3FF) << 16);
            break;
        case LCD_8BIT_MONO:
            regValue |= ((((aSettings->iHorizontalPixelsPerLine / 8) - 1)
                    & 0x3FF) << 16);
            break;
        case LCD_COLOR_STN:
            regValue |= (((((aSettings->iHorizontalPixelsPerLine * 3) / 8) - 1)
                    & 0x3FF) << 16);
            break;
    }

    // Find the dot clock divider with the fastest clock rate to match the requested
    // dot clock rate without going over.
    for (dotClockDivider = 0; dotClockDivider < 0x0F; dotClockDivider++) {
        calcDiv = (PROCESSOR_OSCILLATOR_FREQUENCY / (dotClockDivider + 2));
        if (calcDiv <= aSettings->iDotClockHz)
            break;
    }
    regValue |= dotClockDivider;

    LCD->POL = regValue;

    // skip line end control
    if (aSettings->iLineEndDelay) {
        // Enable and set
        LCD->LE = ((aSettings->iLineEndDelay - 1) << 0) | (1 << 16);
    } else {
        LCD->LE = 0;
    }

    // disable interrupts
    // TBD: May need vertical interrupt in the future
    LCD->INTMSK = 0;

    switch (aSettings->iColorResolution) {
        default:
        case LCD_COLOR_RES_1:
            regValue = (0 << LCD_CTRL_LcdBpp_BIT);
            break;
        case LCD_COLOR_RES_2:
            regValue = (1 << LCD_CTRL_LcdBpp_BIT);
            break;
        case LCD_COLOR_RES_4:
            regValue = (2 << LCD_CTRL_LcdBpp_BIT);
            break;
        case LCD_COLOR_RES_8:
            regValue = (3 << LCD_CTRL_LcdBpp_BIT);
            break;
        case LCD_COLOR_RES_12_444:
            regValue = (7 << LCD_CTRL_LcdBpp_BIT);
            break;
        case LCD_COLOR_RES_16_I555:
            regValue = (4 << LCD_CTRL_LcdBpp_BIT);
            break;
        case LCD_COLOR_RES_16_565:
            regValue = (6 << LCD_CTRL_LcdBpp_BIT);
            break;
        case LCD_COLOR_RES_24:
            regValue = (5 << LCD_CTRL_LcdBpp_BIT);
            break;
    }

    // default BGR
    if (aSettings->iColorOrder == LCD_COLOR_ORDER_BGR)
        regValue |= LCD_CTRL_BGR;

    switch (aSettings->iPanelType) {
        case LCD_ADVANCED_TFT:
        case LCD_HIGHLY_REFLECTIVE_TFT:
        case LCD_STANDARD_TFT:
            // Enable port and use TFT
            regValue |= LCD_CTRL_LcdTFT;
            break;
        case LCD_4BIT_MONO:
            // Enable port and use 4-bit STN
            regValue |= LCD_CTRL_LcdBW;
            break;
        case LCD_8BIT_MONO: // Enable port and use 8-bit STN
            regValue |= (LCD_CTRL_LcdMon8 | LCD_CTRL_LcdBW);
            break;
        case LCD_COLOR_STN:
            break;
        default:
            // ERROR
            break;
    }

    if (aSettings->iIsDualPanel)
        regValue |= LCD_CTRL_LcdDual;

    LCD->CTRL = regValue;

    // clear palette (all black)
    pPal = (TUInt32*)(&(LCD->PAL));
    for (i = 0; i < 128; i++) {
        *pPal = 0;
        pPal++;
    }

    // 0 = divide by 1 dot clock
    //TBD: Where is this register really?    LCD->CFG = 0x0;

    // Set the base address
    p->iBaseAddress = aSettings->iBaseAddress;
    LCD->UPBASE = p->iBaseAddress;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC546xx_LCDController_On
 *---------------------------------------------------------------------------*
 * Description:
 *      Power on and enable the LCD.
 * Inputs:
 *      void *aWorkspace          -- LCD Controller's workspace
 * Outputs:
 *      T_uezError                 -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC546xx_LCDController_On(void *aWorkspace)
{
    T_workspace *p = (T_workspace *)aWorkspace;

    // Ensure the LCD is enabled and powered
    LCD->CTRL |= LCD_CTRL_LcdEn;
    LCD->CTRL |= LCD_CTRL_LcdPwr;

    if (p->iPowerPort) {
        if (p->iPowerPinIsActiveHigh) {
            (*p->iPowerPort)->Set(p->iPowerPort, p->iPowerPin);
        } else {
            (*p->iPowerPort)->Clear(p->iPowerPort, p->iPowerPin);
        }
    }

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC546xx_LCDController_Off
 *---------------------------------------------------------------------------*
 * Description:
 *      Power off and disable the LCD.
 * Inputs:
 *      void *aWorkspace          -- LCD Controller's workspace
 * Outputs:
 *      T_uezError                 -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC546xx_LCDController_Off(void *aWorkspace)
{
    T_workspace *p = (T_workspace *)aWorkspace;

    // Ensure the LCD is enabled and powered
    LCD->CTRL &= ~LCD_CTRL_LcdEn;
    LCD->CTRL &= ~LCD_CTRL_LcdPwr;

    // Turn off the power pin if we have one
    if (p->iPowerPort) {
        if (p->iPowerPinIsActiveHigh) {
            (*p->iPowerPort)->Clear(p->iPowerPort, p->iPowerPin);
        } else {
            (*p->iPowerPort)->Set(p->iPowerPort, p->iPowerPin);
        }
    }

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC546xx_LCDController_SetBacklightLevel
 *---------------------------------------------------------------------------*
 * Description:
 *      Control the backlight level.  For LPC546xx, this is not a feature.
 * Inputs:
 *      void *aWorkspace          -- LCD Controller's workspace
 *      TUInt32 aLevel            -- Level to use
 * Outputs:
 *      T_uezError                 -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC546xx_LCDController_SetBacklightLevel(
        void *aWorkspace,
        TUInt32 aLevel)
{
    // Not handled here in this LCD Controller
    return UEZ_ERROR_NOT_SUPPORTED;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC546xx_LCDController_SetBaseAddr
 *---------------------------------------------------------------------------*
 * Description:
 *      Changes the address in memory where the LCD controller gets it's
 *      pixels and if that change should occur synchronously.
 * Inputs:
 *      void *aWorkspace          -- LCD Controller's workspace
 *      TUInt32 aBaseAddress      -- New pixel memory base address
 *      TBool aSync               -- Wait for raster?
 * Outputs:
 *      T_uezError                 -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC546xx_LCDController_SetBaseAddr(
        void *aWorkspace,
        TUInt32 aBaseAddress,
        TBool aSync)
{
    T_workspace *p = (T_workspace *)aWorkspace;

    p->iBaseAddress = aBaseAddress;
    LCD->UPBASE = p->iBaseAddress;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC546xx_LCDController_SetPaletteColor
 *---------------------------------------------------------------------------*
 * Description:
 *      Change the color of a palette entry given the red, green, blue
 *      component of a particular color index.  The color components are
 *      expressed in full 16-bit values at a higher resolution than
 *      the hardware can usually perform.  The color is down shifted to what
 *      the hardware can handle.
 * Inputs:
 *      void *aWorkspace            -- LCD Controller's workspace
 *      TUInt32 aColorIndex         -- Index to palette entry
 *      TUInt16 aRed                -- Red value
 *      TUInt16 aGreen              -- Green value
 *      TUInt16 aBlue               -- Blue value
 * Outputs:
 *      T_uezError               -- If successful, returns UEZ_ERROR_NONE.
 *                                  If the index is invalid, returns
 *                                  UEZ_ERROR_OUT_OF_RANGE.
 *---------------------------------------------------------------------------*/
T_uezError LPC546xx_LCDController_SetPaletteColor(
        void *aWorkspace,
        TUInt32 aColorIndex,
        TUInt16 aRed,
        TUInt16 aGreen,
        TUInt16 aBlue)
{
    TUInt32 *pPal;
    T_workspace *p = (T_workspace *)aWorkspace;
    TUInt16 neighbor;
    TUInt32 aPackedColor;

